Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_reg.h
/** \brief 94, Antenna Offset */
#define SPU0_BE1_A3_ANTOFST /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_A_ANTOFST*)0xFA800094u)

/** \brief 98, Unloader Configuration */
#define SPU0_BE1_UNLDR_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF*)0xFA800098u)

/** \brief 9C, Unloader Configuration 2 */
#define SPU0_BE1_UNLDR_CONF2 /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF2*)0xFA80009Cu)

/** \brief A4, Output Data Processor Configuration */
#define SPU0_BE1_ODP_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_ODP_CONF*)0xFA8000A4u)

/** \brief A8, NCI Control */
#define SPU0_BE1_NCICTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_NCICTRL*)0xFA8000A8u)

/** \brief AC, Summation Unit Control */
#define SPU0_BE1_SUMCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_SUMCTRL*)0xFA8000ACu)

/** \brief B0, Power Summation */
#define SPU0_BE1_PWRSUM /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_PWRSUM*)0xFA8000B0u)

/** \brief B4, Power Information Channel Control */
#define SPU0_BE1_PWRCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_PWRCTRL*)0xFA8000B4u)

/** \brief B8, CFAR Module Control */
#define SPU0_BE1_CFARCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_CFARCTRL*)0xFA8000B8u)

/** \brief BC, Sideband Control */
#define SPU0_BE1_SBCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_SBCTRL*)0xFA8000BCu)

/** \brief C0, Bin Rejection Mask */
#define SPU0_BIN0_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000C0u)

/** \brief C4, Bin Rejection Mask */
#define SPU0_BIN1_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000C4u)

/** \brief C8, Bin Rejection Mask */
#define SPU0_BIN2_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000C8u)

/** \brief CC, Bin Rejection Mask */
#define SPU0_BIN3_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000CCu)

/** \brief D0, Bin Rejection Mask */
#define SPU0_BIN4_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000D0u)

/** \brief D4, Bin Rejection Mask */
#define SPU0_BIN5_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000D4u)

/** \brief D8, Bin Rejection Mask */
#define SPU0_BIN6_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000D8u)

/** \brief DC, Bin Rejection Mask */
#define SPU0_BIN7_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000DCu)

/** \brief E0, Bin Rejection Mask */
#define SPU0_BIN8_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000E0u)

/** \brief E4, Bin Rejection Mask */
#define SPU0_BIN9_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000E4u)

/** \brief E8, Bin Rejection Mask */
#define SPU0_BIN10_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000E8u)

/** \brief EC, Bin Rejection Mask */
#define SPU0_BIN11_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000ECu)

/** \brief F0, Bin Rejection Mask */
#define SPU0_BIN12_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000F0u)

/** \brief F4, Bin Rejection Mask */
#define SPU0_BIN13_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000F4u)

/** \brief F8, Bin Rejection Mask */
#define SPU0_BIN14_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000F8u)

/** \brief FC, Bin Rejection Mask */
#define SPU0_BIN15_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000FCu)

/** \brief 100, Bin Rejection Mask */
#define SPU0_BIN16_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800100u)

/** \brief 104, Bin Rejection Mask */
#define SPU0_BIN17_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800104u)

/** \brief 108, Bin Rejection Mask */
#define SPU0_BIN18_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800108u)

/** \brief 10C, Bin Rejection Mask */
#define SPU0_BIN19_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80010Cu)

/** \brief 110, Bin Rejection Mask */
#define SPU0_BIN20_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800110u)

/** \brief 114, Bin Rejection Mask */
#define SPU0_BIN21_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800114u)

/** \brief 118, Bin Rejection Mask */
#define SPU0_BIN22_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800118u)

/** \brief 11C, Bin Rejection Mask */
#define SPU0_BIN23_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80011Cu)

/** \brief 120, Bin Rejection Mask */
#define SPU0_BIN24_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800120u)

/** \brief 124, Bin Rejection Mask */
#define SPU0_BIN25_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800124u)

/** \brief 128, Bin Rejection Mask */
#define SPU0_BIN26_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800128u)

/** \brief 12C, Bin Rejection Mask */
#define SPU0_BIN27_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80012Cu)

/** \brief 130, Bin Rejection Mask */
#define SPU0_BIN28_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800130u)

/** \brief 134, Bin Rejection Mask */
#define SPU0_BIN29_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800134u)

/** \brief 138, Bin Rejection Mask */
#define SPU0_BIN30_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800138u)

/** \brief 13C, Bin Rejection Mask */
#define SPU0_BIN31_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80013Cu)

/** \brief 140, Bin Rejection Mask */
#define SPU0_BIN32_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800140u)

/** \brief 144, Bin Rejection Mask */
#define SPU0_BIN33_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800144u)

/** \brief 148, Bin Rejection Mask */
#define SPU0_BIN34_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800148u)

/** \brief 14C, Bin Rejection Mask */
#define SPU0_BIN35_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80014Cu)

/** \brief 150, Bin Rejection Mask */
#define SPU0_BIN36_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800150u)

/** \brief 154, Bin Rejection Mask */
#define SPU0_BIN37_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800154u)

/** \brief 158, Bin Rejection Mask */
#define SPU0_BIN38_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800158u)

/** \brief 15C, Bin Rejection Mask */
#define SPU0_BIN39_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80015Cu)

/** \brief 160, Bin Rejection Mask */
#define SPU0_BIN40_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800160u)

/** \brief 164, Bin Rejection Mask */
#define SPU0_BIN41_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800164u)

