Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_reg.h
/** \brief 168, Bin Rejection Mask */
#define SPU0_BIN42_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800168u)

/** \brief 16C, Bin Rejection Mask */
#define SPU0_BIN43_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80016Cu)

/** \brief 170, Bin Rejection Mask */
#define SPU0_BIN44_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800170u)

/** \brief 174, Bin Rejection Mask */
#define SPU0_BIN45_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800174u)

/** \brief 178, Bin Rejection Mask */
#define SPU0_BIN46_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800178u)

/** \brief 17C, Bin Rejection Mask */
#define SPU0_BIN47_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80017Cu)

/** \brief 180, Bin Rejection Mask */
#define SPU0_BIN48_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800180u)

/** \brief 184, Bin Rejection Mask */
#define SPU0_BIN49_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800184u)

/** \brief 188, Bin Rejection Mask */
#define SPU0_BIN50_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800188u)

/** \brief 18C, Bin Rejection Mask */
#define SPU0_BIN51_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80018Cu)

/** \brief 190, Bin Rejection Mask */
#define SPU0_BIN52_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800190u)

/** \brief 194, Bin Rejection Mask */
#define SPU0_BIN53_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800194u)

/** \brief 198, Bin Rejection Mask */
#define SPU0_BIN54_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800198u)

/** \brief 19C, Bin Rejection Mask */
#define SPU0_BIN55_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80019Cu)

/** \brief 1A0, Bin Rejection Mask */
#define SPU0_BIN56_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001A0u)

/** \brief 1A4, Bin Rejection Mask */
#define SPU0_BIN57_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001A4u)

/** \brief 1A8, Bin Rejection Mask */
#define SPU0_BIN58_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001A8u)

/** \brief 1AC, Bin Rejection Mask */
#define SPU0_BIN59_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001ACu)

/** \brief 1B0, Bin Rejection Mask */
#define SPU0_BIN60_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001B0u)

/** \brief 1B4, Bin Rejection Mask */
#define SPU0_BIN61_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001B4u)

/** \brief 1B8, Bin Rejection Mask */
#define SPU0_BIN62_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001B8u)

/** \brief 1BC, Bin Rejection Mask */
#define SPU0_BIN63_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001BCu)

/** \brief 1C0, Magnitude Approximation Constants */
#define SPU0_MAGAPPROX /*lint --e(923)*/ (*(volatile Ifx_SPU_MAGAPPROX*)0xFA8001C0u)

/** \brief 1C4, NCI Antennae Scaling Factor */
#define SPU0_NCISCALAR0 /*lint --e(923)*/ (*(volatile Ifx_SPU_NCISCALAR0*)0xFA8001C4u)

/** \brief 1C8, NCI Antennae Scaling Factor */
#define SPU0_NCISCALAR1 /*lint --e(923)*/ (*(volatile Ifx_SPU_NCISCALAR1*)0xFA8001C8u)

/** \brief 1CC, NCI Antennae Scaling Factor */
#define SPU0_NCISCALAR2 /*lint --e(923)*/ (*(volatile Ifx_SPU_NCISCALAR2*)0xFA8001CCu)

/** \brief 1D0, NCI Antennae Scaling Factor */
#define SPU0_NCISCALAR3 /*lint --e(923)*/ (*(volatile Ifx_SPU_NCISCALAR3*)0xFA8001D0u)

/** \brief 1D4, CFAR Configuration */
#define SPU0_CFARCFG /*lint --e(923)*/ (*(volatile Ifx_SPU_CFARCFG*)0xFA8001D4u)

/** \brief 1D8, CFAR Configuration 2 */
#define SPU0_CFARCFG2 /*lint --e(923)*/ (*(volatile Ifx_SPU_CFARCFG2*)0xFA8001D8u)

/** \brief 1DC, CFAR Configuration 3 */
#define SPU0_CFARCFG3 /*lint --e(923)*/ (*(volatile Ifx_SPU_CFARCFG3*)0xFA8001DCu)

/** \brief 1E0, Scalar Addition Operand */
#define SPU0_SCALARADD /*lint --e(923)*/ (*(volatile Ifx_SPU_SCALARADD*)0xFA8001E0u)

/** \brief 1E4, Scalar Multiplication Operand */
#define SPU0_SCALARMULT /*lint --e(923)*/ (*(volatile Ifx_SPU_SCALARMULT*)0xFA8001E4u)

/** \brief 1E8, Bin Rejection Unit Control */
#define SPU0_BINREJCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BINREJCTRL*)0xFA8001E8u)

/** \brief 1EC, Local Maximum Control */
#define SPU0_LCLMAX /*lint --e(923)*/ (*(volatile Ifx_SPU_LCLMAX*)0xFA8001ECu)

/** \brief 1F0, SPU Control */
#define SPU0_CTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_CTRL*)0xFA8001F0u)

/** \brief 200, Dataset Metadata */
#define SPU0_MD0_METADATA /*lint --e(923)*/ (*(volatile Ifx_SPU_MD_METADATA*)0xFA800200u)

/** \brief 204, Dataset Metadata */
#define SPU0_MD1_METADATA /*lint --e(923)*/ (*(volatile Ifx_SPU_MD_METADATA*)0xFA800204u)

/** \brief 280, Input DMA Count */
#define SPU0_IDMCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_IDMCNT*)0xFA800280u)

/** \brief 284, Input Buffer Memory Count */
#define SPU0_IBMCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_IBMCNT*)0xFA800284u)

/** \brief 288, Input Buffer Memory Read Count */
#define SPU0_LDRCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_LDRCNT*)0xFA800288u)

/** \brief 28C, FFT Load Count */
#define SPU0_FFTWCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_FFTWCNT*)0xFA80028Cu)

/** \brief 290, FFT Unload Count */
#define SPU0_FFTRCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_FFTRCNT*)0xFA800290u)

/** \brief 294, Output Buffer Memory Write Count */
#define SPU0_ULDRCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ULDRCNT*)0xFA800294u)

/** \brief 298, Output Buffer Memory Read Count */
#define SPU0_ODMCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMCNT*)0xFA800298u)

/** \brief 29C, Bin Rejection Unit Load Count */
#define SPU0_BRCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_BRCNT*)0xFA80029Cu)

/** \brief 2A0, CFAR Unit Load Count */
#define SPU0_CFARCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_CFARCNT*)0xFA8002A0u)

/** \brief 2A4, Output DMA Port Write Count */
#define SPU0_ODMACNT0_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFA8002A4u)

/** \brief 2A8, Output DMA Port Write Count */
#define SPU0_ODMACNT1_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFA8002A8u)

