Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_reg.h
/** \brief 2AC, Output DMA Port Write Count */
#define SPU0_ODMACNT2_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFA8002ACu)

/** \brief 2B0, Output DMA Port Write Count */
#define SPU0_ODMACNT3_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFA8002B0u)

/** \brief 2B4, Output DMA Port Write Count */
#define SPU0_ODMACNT4_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFA8002B4u)

/** \brief 2B8, Output DMA Port Write Count */
#define SPU0_ODMACNT5_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFA8002B8u)

/** \brief 2BC, Output DMA Port Write Count */
#define SPU0_ODMACNT6_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFA8002BCu)

/** \brief 2C0, Output DMA Port Write Count */
#define SPU0_ODMACNT7_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFA8002C0u)

/** \brief 2C4, Safety Counter Clear */
#define SPU0_CNTCLR /*lint --e(923)*/ (*(volatile Ifx_SPU_CNTCLR*)0xFA8002C4u)

/** \brief 2C8, SPU Monitor */
#define SPU0_MONITOR /*lint --e(923)*/ (*(volatile Ifx_SPU_MONITOR*)0xFA8002C8u)

/** \brief 3E4, Access Enable Register 0 */
#define SPU0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_SPU_ACCEN0*)0xFA8003E4u)

/** \brief 3E8, Access Enable Register 1 */
#define SPU0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_SPU_ACCEN1*)0xFA8003E8u)

/** \brief 3EC, OCDS Control and Status */
#define SPU0_OCS /*lint --e(923)*/ (*(volatile Ifx_SPU_OCS*)0xFA8003ECu)

/** \brief 3F0, OCDS Debug Access Register */
#define SPU0_ODA /*lint --e(923)*/ (*(volatile Ifx_SPU_ODA*)0xFA8003F0u)

/** \brief 3F4, Kernel Reset Register 0 */
#define SPU0_KRST0 /*lint --e(923)*/ (*(volatile Ifx_SPU_KRST0*)0xFA8003F4u)

/** \brief 3F8, Kernel Reset Register 1 */
#define SPU0_KRST1 /*lint --e(923)*/ (*(volatile Ifx_SPU_KRST1*)0xFA8003F8u)

/** \brief 3FC, Kernel Reset Clear */
#define SPU0_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_SPU_KRSTCLR*)0xFA8003FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Spu_Cfg_Spu1
 * \{  */
/** \brief 0, Clock Control */
#define SPU1_CLC /*lint --e(923)*/ (*(volatile Ifx_SPU_CLC*)0xFAC00000u)

/** \brief 4, Module Identification Register */
#define SPU1_MODID /*lint --e(923)*/ (*(volatile Ifx_SPU_MODID*)0xFAC00004u)

/** \brief 8, Status and Reporting */
#define SPU1_STAT /*lint --e(923)*/ (*(volatile Ifx_SPU_STAT*)0xFAC00008u)

/** \brief 10, Input DMA Configuration */
#define SPU1_ID_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_ID_CONF*)0xFAC00010u)

/** \brief 14, Input DMA Configuration 2 */
#define SPU1_ID_CONF2 /*lint --e(923)*/ (*(volatile Ifx_SPU_ID_CONF2*)0xFAC00014u)

/** \brief 18, Input DMA Configuration: Radar Memory */
#define SPU1_ID_RM_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_ID_RM_CONF*)0xFAC00018u)

/** \brief 1C, Inner Loop Address Offset */
#define SPU1_ID_RM_ILO /*lint --e(923)*/ (*(volatile Ifx_SPU_ID_RM_ILO*)0xFAC0001Cu)

/** \brief 20, Outer Loop Address Offset */
#define SPU1_ID_RM_OLO /*lint --e(923)*/ (*(volatile Ifx_SPU_ID_RM_OLO*)0xFAC00020u)

/** \brief 24, Bin Offset Address Configuration */
#define SPU1_ID_RM_BLO /*lint --e(923)*/ (*(volatile Ifx_SPU_ID_RM_BLO*)0xFAC00024u)

/** \brief 28, Inner and Outer Loop Repeat */
#define SPU1_ID_RM_IOLR /*lint --e(923)*/ (*(volatile Ifx_SPU_ID_RM_IOLR*)0xFAC00028u)

/** \brief 2C, Bin Loop Repeat */
#define SPU1_ID_RM_BLR /*lint --e(923)*/ (*(volatile Ifx_SPU_ID_RM_BLR*)0xFAC0002Cu)

/** \brief 30,  */
#define SPU1_ID_RM_ACFG0 /*lint --e(923)*/ (*(volatile Ifx_SPU_ID_RM_ACFG0*)0xFAC00030u)

/** \brief 34,  */
#define SPU1_ID_RM_ACFG1 /*lint --e(923)*/ (*(volatile Ifx_SPU_ID_RM_ACFG1*)0xFAC00034u)

/** \brief 38, Pre-Acquisition Counter */
#define SPU1_PACTR /*lint --e(923)*/ (*(volatile Ifx_SPU_PACTR*)0xFAC00038u)

/** \brief 3C, Double Pass Configuration */
#define SPU1_DPASS_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_DPASS_CONF*)0xFAC0003Cu)

/** \brief 40, Loader Configuration */
#define SPU1_BE0_LDR_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_LDR_CONF*)0xFAC00040u)

/** \brief 44, Loader Configuration Extended */
#define SPU1_BE0_LDR_CONF2 /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_LDR_CONF2*)0xFAC00044u)

/** \brief 48, Antenna Offset */
#define SPU1_BE0_A0_ANTOFST /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_A_ANTOFST*)0xFAC00048u)

/** \brief 4C, Antenna Offset */
#define SPU1_BE0_A1_ANTOFST /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_A_ANTOFST*)0xFAC0004Cu)

/** \brief 50, Antenna Offset */
#define SPU1_BE0_A2_ANTOFST /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_A_ANTOFST*)0xFAC00050u)

/** \brief 54, Antenna Offset */
#define SPU1_BE0_A3_ANTOFST /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_A_ANTOFST*)0xFAC00054u)

/** \brief 58, Unloader Configuration */
#define SPU1_BE0_UNLDR_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF*)0xFAC00058u)

/** \brief 5C, Unloader Configuration 2 */
#define SPU1_BE0_UNLDR_CONF2 /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF2*)0xFAC0005Cu)

/** \brief 64, Output Data Processor Configuration */
#define SPU1_BE0_ODP_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_ODP_CONF*)0xFAC00064u)

/** \brief 68, NCI Control */
#define SPU1_BE0_NCICTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_NCICTRL*)0xFAC00068u)

/** \brief 6C, Summation Unit Control */
#define SPU1_BE0_SUMCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_SUMCTRL*)0xFAC0006Cu)

/** \brief 70, Power Summation */
#define SPU1_BE0_PWRSUM /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_PWRSUM*)0xFAC00070u)

/** \brief 74, Power Information Channel Control */
#define SPU1_BE0_PWRCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_PWRCTRL*)0xFAC00074u)

/** \brief 78, CFAR Module Control */
#define SPU1_BE0_CFARCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_CFARCTRL*)0xFAC00078u)

/** \brief 7C, Sideband Control */
#define SPU1_BE0_SBCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_SBCTRL*)0xFAC0007Cu)

/** \brief 80, Loader Configuration */
#define SPU1_BE1_LDR_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_LDR_CONF*)0xFAC00080u)

/** \brief 84, Loader Configuration Extended */
#define SPU1_BE1_LDR_CONF2 /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_LDR_CONF2*)0xFAC00084u)

/** \brief 88, Antenna Offset */
#define SPU1_BE1_A0_ANTOFST /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_A_ANTOFST*)0xFAC00088u)

/** \brief 8C, Antenna Offset */
#define SPU1_BE1_A1_ANTOFST /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_A_ANTOFST*)0xFAC0008Cu)

/** \brief 90, Antenna Offset */
#define SPU1_BE1_A2_ANTOFST /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_A_ANTOFST*)0xFAC00090u)

