Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_reg.h
/** \brief 94, Antenna Offset */
#define SPU1_BE1_A3_ANTOFST /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_A_ANTOFST*)0xFAC00094u)

/** \brief 98, Unloader Configuration */
#define SPU1_BE1_UNLDR_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF*)0xFAC00098u)

/** \brief 9C, Unloader Configuration 2 */
#define SPU1_BE1_UNLDR_CONF2 /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF2*)0xFAC0009Cu)

/** \brief A4, Output Data Processor Configuration */
#define SPU1_BE1_ODP_CONF /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_ODP_CONF*)0xFAC000A4u)

/** \brief A8, NCI Control */
#define SPU1_BE1_NCICTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_NCICTRL*)0xFAC000A8u)

/** \brief AC, Summation Unit Control */
#define SPU1_BE1_SUMCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_SUMCTRL*)0xFAC000ACu)

/** \brief B0, Power Summation */
#define SPU1_BE1_PWRSUM /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_PWRSUM*)0xFAC000B0u)

/** \brief B4, Power Information Channel Control */
#define SPU1_BE1_PWRCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_PWRCTRL*)0xFAC000B4u)

/** \brief B8, CFAR Module Control */
#define SPU1_BE1_CFARCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_CFARCTRL*)0xFAC000B8u)

/** \brief BC, Sideband Control */
#define SPU1_BE1_SBCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BE_SBCTRL*)0xFAC000BCu)

/** \brief C0, Bin Rejection Mask */
#define SPU1_BIN0_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000C0u)

/** \brief C4, Bin Rejection Mask */
#define SPU1_BIN1_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000C4u)

/** \brief C8, Bin Rejection Mask */
#define SPU1_BIN2_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000C8u)

/** \brief CC, Bin Rejection Mask */
#define SPU1_BIN3_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000CCu)

/** \brief D0, Bin Rejection Mask */
#define SPU1_BIN4_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000D0u)

/** \brief D4, Bin Rejection Mask */
#define SPU1_BIN5_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000D4u)

/** \brief D8, Bin Rejection Mask */
#define SPU1_BIN6_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000D8u)

/** \brief DC, Bin Rejection Mask */
#define SPU1_BIN7_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000DCu)

/** \brief E0, Bin Rejection Mask */
#define SPU1_BIN8_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000E0u)

/** \brief E4, Bin Rejection Mask */
#define SPU1_BIN9_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000E4u)

/** \brief E8, Bin Rejection Mask */
#define SPU1_BIN10_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000E8u)

/** \brief EC, Bin Rejection Mask */
#define SPU1_BIN11_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000ECu)

/** \brief F0, Bin Rejection Mask */
#define SPU1_BIN12_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000F0u)

/** \brief F4, Bin Rejection Mask */
#define SPU1_BIN13_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000F4u)

/** \brief F8, Bin Rejection Mask */
#define SPU1_BIN14_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000F8u)

/** \brief FC, Bin Rejection Mask */
#define SPU1_BIN15_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000FCu)

/** \brief 100, Bin Rejection Mask */
#define SPU1_BIN16_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00100u)

/** \brief 104, Bin Rejection Mask */
#define SPU1_BIN17_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00104u)

/** \brief 108, Bin Rejection Mask */
#define SPU1_BIN18_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00108u)

/** \brief 10C, Bin Rejection Mask */
#define SPU1_BIN19_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0010Cu)

/** \brief 110, Bin Rejection Mask */
#define SPU1_BIN20_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00110u)

/** \brief 114, Bin Rejection Mask */
#define SPU1_BIN21_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00114u)

/** \brief 118, Bin Rejection Mask */
#define SPU1_BIN22_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00118u)

/** \brief 11C, Bin Rejection Mask */
#define SPU1_BIN23_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0011Cu)

/** \brief 120, Bin Rejection Mask */
#define SPU1_BIN24_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00120u)

/** \brief 124, Bin Rejection Mask */
#define SPU1_BIN25_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00124u)

/** \brief 128, Bin Rejection Mask */
#define SPU1_BIN26_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00128u)

/** \brief 12C, Bin Rejection Mask */
#define SPU1_BIN27_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0012Cu)

/** \brief 130, Bin Rejection Mask */
#define SPU1_BIN28_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00130u)

/** \brief 134, Bin Rejection Mask */
#define SPU1_BIN29_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00134u)

/** \brief 138, Bin Rejection Mask */
#define SPU1_BIN30_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00138u)

/** \brief 13C, Bin Rejection Mask */
#define SPU1_BIN31_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0013Cu)

/** \brief 140, Bin Rejection Mask */
#define SPU1_BIN32_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00140u)

/** \brief 144, Bin Rejection Mask */
#define SPU1_BIN33_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00144u)

/** \brief 148, Bin Rejection Mask */
#define SPU1_BIN34_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00148u)

/** \brief 14C, Bin Rejection Mask */
#define SPU1_BIN35_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0014Cu)

/** \brief 150, Bin Rejection Mask */
#define SPU1_BIN36_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00150u)

/** \brief 154, Bin Rejection Mask */
#define SPU1_BIN37_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00154u)

/** \brief 158, Bin Rejection Mask */
#define SPU1_BIN38_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00158u)

/** \brief 15C, Bin Rejection Mask */
#define SPU1_BIN39_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0015Cu)

/** \brief 160, Bin Rejection Mask */
#define SPU1_BIN40_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00160u)

/** \brief 164, Bin Rejection Mask */
#define SPU1_BIN41_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00164u)

