Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_reg.h
/** \brief 168, Bin Rejection Mask */
#define SPU1_BIN42_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00168u)

/** \brief 16C, Bin Rejection Mask */
#define SPU1_BIN43_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0016Cu)

/** \brief 170, Bin Rejection Mask */
#define SPU1_BIN44_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00170u)

/** \brief 174, Bin Rejection Mask */
#define SPU1_BIN45_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00174u)

/** \brief 178, Bin Rejection Mask */
#define SPU1_BIN46_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00178u)

/** \brief 17C, Bin Rejection Mask */
#define SPU1_BIN47_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0017Cu)

/** \brief 180, Bin Rejection Mask */
#define SPU1_BIN48_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00180u)

/** \brief 184, Bin Rejection Mask */
#define SPU1_BIN49_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00184u)

/** \brief 188, Bin Rejection Mask */
#define SPU1_BIN50_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00188u)

/** \brief 18C, Bin Rejection Mask */
#define SPU1_BIN51_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0018Cu)

/** \brief 190, Bin Rejection Mask */
#define SPU1_BIN52_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00190u)

/** \brief 194, Bin Rejection Mask */
#define SPU1_BIN53_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00194u)

/** \brief 198, Bin Rejection Mask */
#define SPU1_BIN54_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00198u)

/** \brief 19C, Bin Rejection Mask */
#define SPU1_BIN55_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0019Cu)

/** \brief 1A0, Bin Rejection Mask */
#define SPU1_BIN56_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001A0u)

/** \brief 1A4, Bin Rejection Mask */
#define SPU1_BIN57_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001A4u)

/** \brief 1A8, Bin Rejection Mask */
#define SPU1_BIN58_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001A8u)

/** \brief 1AC, Bin Rejection Mask */
#define SPU1_BIN59_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001ACu)

/** \brief 1B0, Bin Rejection Mask */
#define SPU1_BIN60_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001B0u)

/** \brief 1B4, Bin Rejection Mask */
#define SPU1_BIN61_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001B4u)

/** \brief 1B8, Bin Rejection Mask */
#define SPU1_BIN62_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001B8u)

/** \brief 1BC, Bin Rejection Mask */
#define SPU1_BIN63_REJ /*lint --e(923)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001BCu)

/** \brief 1C0, Magnitude Approximation Constants */
#define SPU1_MAGAPPROX /*lint --e(923)*/ (*(volatile Ifx_SPU_MAGAPPROX*)0xFAC001C0u)

/** \brief 1C4, NCI Antennae Scaling Factor */
#define SPU1_NCISCALAR0 /*lint --e(923)*/ (*(volatile Ifx_SPU_NCISCALAR0*)0xFAC001C4u)

/** \brief 1C8, NCI Antennae Scaling Factor */
#define SPU1_NCISCALAR1 /*lint --e(923)*/ (*(volatile Ifx_SPU_NCISCALAR1*)0xFAC001C8u)

/** \brief 1CC, NCI Antennae Scaling Factor */
#define SPU1_NCISCALAR2 /*lint --e(923)*/ (*(volatile Ifx_SPU_NCISCALAR2*)0xFAC001CCu)

/** \brief 1D0, NCI Antennae Scaling Factor */
#define SPU1_NCISCALAR3 /*lint --e(923)*/ (*(volatile Ifx_SPU_NCISCALAR3*)0xFAC001D0u)

/** \brief 1D4, CFAR Configuration */
#define SPU1_CFARCFG /*lint --e(923)*/ (*(volatile Ifx_SPU_CFARCFG*)0xFAC001D4u)

/** \brief 1D8, CFAR Configuration 2 */
#define SPU1_CFARCFG2 /*lint --e(923)*/ (*(volatile Ifx_SPU_CFARCFG2*)0xFAC001D8u)

/** \brief 1DC, CFAR Configuration 3 */
#define SPU1_CFARCFG3 /*lint --e(923)*/ (*(volatile Ifx_SPU_CFARCFG3*)0xFAC001DCu)

/** \brief 1E0, Scalar Addition Operand */
#define SPU1_SCALARADD /*lint --e(923)*/ (*(volatile Ifx_SPU_SCALARADD*)0xFAC001E0u)

/** \brief 1E4, Scalar Multiplication Operand */
#define SPU1_SCALARMULT /*lint --e(923)*/ (*(volatile Ifx_SPU_SCALARMULT*)0xFAC001E4u)

/** \brief 1E8, Bin Rejection Unit Control */
#define SPU1_BINREJCTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_BINREJCTRL*)0xFAC001E8u)

/** \brief 1EC, Local Maximum Control */
#define SPU1_LCLMAX /*lint --e(923)*/ (*(volatile Ifx_SPU_LCLMAX*)0xFAC001ECu)

/** \brief 1F0, SPU Control */
#define SPU1_CTRL /*lint --e(923)*/ (*(volatile Ifx_SPU_CTRL*)0xFAC001F0u)

/** \brief 200, Dataset Metadata */
#define SPU1_MD0_METADATA /*lint --e(923)*/ (*(volatile Ifx_SPU_MD_METADATA*)0xFAC00200u)

/** \brief 204, Dataset Metadata */
#define SPU1_MD1_METADATA /*lint --e(923)*/ (*(volatile Ifx_SPU_MD_METADATA*)0xFAC00204u)

/** \brief 280, Input DMA Count */
#define SPU1_IDMCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_IDMCNT*)0xFAC00280u)

/** \brief 284, Input Buffer Memory Count */
#define SPU1_IBMCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_IBMCNT*)0xFAC00284u)

/** \brief 288, Input Buffer Memory Read Count */
#define SPU1_LDRCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_LDRCNT*)0xFAC00288u)

/** \brief 28C, FFT Load Count */
#define SPU1_FFTWCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_FFTWCNT*)0xFAC0028Cu)

/** \brief 290, FFT Unload Count */
#define SPU1_FFTRCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_FFTRCNT*)0xFAC00290u)

/** \brief 294, Output Buffer Memory Write Count */
#define SPU1_ULDRCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ULDRCNT*)0xFAC00294u)

/** \brief 298, Output Buffer Memory Read Count */
#define SPU1_ODMCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMCNT*)0xFAC00298u)

/** \brief 29C, Bin Rejection Unit Load Count */
#define SPU1_BRCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_BRCNT*)0xFAC0029Cu)

/** \brief 2A0, CFAR Unit Load Count */
#define SPU1_CFARCNT /*lint --e(923)*/ (*(volatile Ifx_SPU_CFARCNT*)0xFAC002A0u)

/** \brief 2A4, Output DMA Port Write Count */
#define SPU1_ODMACNT0_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFAC002A4u)

/** \brief 2A8, Output DMA Port Write Count */
#define SPU1_ODMACNT1_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFAC002A8u)

