Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_reg.h
/** \brief 2AC, Output DMA Port Write Count */
#define SPU1_ODMACNT2_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFAC002ACu)

/** \brief 2B0, Output DMA Port Write Count */
#define SPU1_ODMACNT3_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFAC002B0u)

/** \brief 2B4, Output DMA Port Write Count */
#define SPU1_ODMACNT4_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFAC002B4u)

/** \brief 2B8, Output DMA Port Write Count */
#define SPU1_ODMACNT5_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFAC002B8u)

/** \brief 2BC, Output DMA Port Write Count */
#define SPU1_ODMACNT6_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFAC002BCu)

/** \brief 2C0, Output DMA Port Write Count */
#define SPU1_ODMACNT7_ODMACNT /*lint --e(923)*/ (*(volatile Ifx_SPU_ODMACNT_ODMACNT*)0xFAC002C0u)

/** \brief 2C4, Safety Counter Clear */
#define SPU1_CNTCLR /*lint --e(923)*/ (*(volatile Ifx_SPU_CNTCLR*)0xFAC002C4u)

/** \brief 2C8, SPU Monitor */
#define SPU1_MONITOR /*lint --e(923)*/ (*(volatile Ifx_SPU_MONITOR*)0xFAC002C8u)

/** \brief 3E4, Access Enable Register 0 */
#define SPU1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_SPU_ACCEN0*)0xFAC003E4u)

/** \brief 3E8, Access Enable Register 1 */
#define SPU1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_SPU_ACCEN1*)0xFAC003E8u)

/** \brief 3EC, OCDS Control and Status */
#define SPU1_OCS /*lint --e(923)*/ (*(volatile Ifx_SPU_OCS*)0xFAC003ECu)

/** \brief 3F0, OCDS Debug Access Register */
#define SPU1_ODA /*lint --e(923)*/ (*(volatile Ifx_SPU_ODA*)0xFAC003F0u)

/** \brief 3F4, Kernel Reset Register 0 */
#define SPU1_KRST0 /*lint --e(923)*/ (*(volatile Ifx_SPU_KRST0*)0xFAC003F4u)

/** \brief 3F8, Kernel Reset Register 1 */
#define SPU1_KRST1 /*lint --e(923)*/ (*(volatile Ifx_SPU_KRST1*)0xFAC003F8u)

/** \brief 3FC, Kernel Reset Clear */
#define SPU1_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_SPU_KRSTCLR*)0xFAC003FCu)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSPU_REG_H */
